Scripts/Serverside/JMeter/jmeter.log
2025-05-18 13:29:35,690 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-05-18 13:29:35,708 INFO o.a.j.JMeter: Loading user properties from: D:\Software\apache-jmeter-5.4.3\bin\user.properties
2025-05-18 13:29:35,710 INFO o.a.j.JMeter: Loading system properties from: D:\Software\apache-jmeter-5.4.3\bin\system.properties
2025-05-18 13:29:35,710 INFO o.a.j.JMeter: Setting JMeter property: threads=1
2025-05-18 13:29:35,710 INFO o.a.j.JMeter: Setting JMeter property: rampup=6
2025-05-18 13:29:35,710 INFO o.a.j.JMeter: Setting JMeter property: duration=60
2025-05-18 13:29:35,718 INFO o.a.j.JMeter: Copyright (c) 1998-2021 The Apache Software Foundation
2025-05-18 13:29:35,718 INFO o.a.j.JMeter: Version 5.4.3
2025-05-18 13:29:35,718 INFO o.a.j.JMeter: java.version=20.0.2
2025-05-18 13:29:35,718 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2025-05-18 13:29:35,718 INFO o.a.j.JMeter: os.name=Windows 11
2025-05-18 13:29:35,718 INFO o.a.j.JMeter: os.arch=amd64
2025-05-18 13:29:35,718 INFO o.a.j.JMeter: os.version=10.0
2025-05-18 13:29:35,718 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-05-18 13:29:35,718 INFO o.a.j.JMeter: java.awt.headless=true
2025-05-18 13:29:35,718 INFO o.a.j.JMeter: Max memory     =1073741824
2025-05-18 13:29:35,718 INFO o.a.j.JMeter: Available Processors =8
2025-05-18 13:29:35,731 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-05-18 13:29:35,731 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-05-18 13:29:35,731 INFO o.a.j.JMeter: JMeterHome=D:\Software\apache-jmeter-5.4.3
2025-05-18 13:29:35,731 INFO o.a.j.JMeter: user.dir  =E:\SachinRJ\Projects\ZipCar-InitialDays\ZipCar-PERF\Scripts\Serverside\JMeter
2025-05-18 13:29:35,731 INFO o.a.j.JMeter: PWD       =E:\SachinRJ\Projects\ZipCar-InitialDays\ZipCar-PERF\Scripts\Serverside\JMeter
2025-05-18 13:29:35,738 INFO o.a.j.JMeter: IP: 192.168.1.55 Name: SachinJadhav-HP-Pavilion FullName: SachinJadhav-HP-Pavilion.bbrouter
2025-05-18 13:29:35,747 INFO o.a.j.s.FileServer: Default base='E:\SachinRJ\Projects\ZipCar-InitialDays\ZipCar-PERF\Scripts\Serverside\JMeter'
2025-05-18 13:29:35,747 INFO o.a.j.s.FileServer: Set new base='E:\SachinRJ\Projects\ZipCar-InitialDays\ZipCar-PERF\Scripts\Serverside\JMeter'
2025-05-18 13:29:35,953 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-05-18 13:29:35,985 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-05-18 13:29:35,985 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-05-18 13:29:35,985 INFO o.a.j.s.SaveService: Loading file: E:\SachinRJ\Projects\ZipCar-InitialDays\ZipCar-PERF\Scripts\Serverside\JMeter\ZipCar-PERF.jmx
2025-05-18 13:29:36,016 INFO o.a.j.p.h.c.CookieManager: Settings: Delete null: true Check: true Allow variable: true Save: false Prefix: COOKIE_
2025-05-18 13:29:36,032 INFO o.a.j.p.h.c.CacheManager: Will only cache the following methods: [GET]
2025-05-18 13:29:36,048 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-05-18 13:29:36,048 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-05-18 13:29:36,048 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-05-18 13:29:36,048 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-05-18 13:29:36,048 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-05-18 13:29:36,048 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-05-18 13:29:36,079 INFO o.a.j.JMeter: Creating summariser <summary>
2025-05-18 13:29:36,095 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-05-18 13:29:36,095 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-05-18 13:29:36,095 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-05-18 13:29:36,107 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-05-18 13:29:36,109 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-05-18 13:29:36,412 INFO o.a.j.JMeter: Running test (1747555176412)
2025-05-18 13:29:36,412 INFO o.a.j.e.StandardJMeterEngine: Starting setUp thread groups
2025-05-18 13:29:36,412 INFO o.a.j.e.StandardJMeterEngine: Starting setUp ThreadGroup: 1 : setUp Thread Group 
2025-05-18 13:29:36,412 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group setUp Thread Group.
2025-05-18 13:29:36,412 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-05-18 13:29:36,412 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2025-05-18 13:29:36,412 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-05-18 13:29:36,412 INFO o.a.j.e.StandardJMeterEngine: Waiting for all setup thread groups to exit
2025-05-18 13:29:36,428 INFO o.a.j.t.JMeterThread: Thread started: setUp Thread Group 1-1
2025-05-18 13:29:36,428 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-05-18 13:29:36,431 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2025-05-18 13:29:36,431 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-05-18 13:29:36,431 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-05-18 13:29:37,203 INFO o.a.j.p.j.s.J.JSR223 Sampler: Environment: PERF, HOST: Perf.ZipCar.com
2025-05-18 13:29:37,203 INFO o.a.j.t.JMeterThread: Thread is done: setUp Thread Group 1-1
2025-05-18 13:29:37,203 INFO o.a.j.t.JMeterThread: Thread finished: setUp Thread Group 1-1
2025-05-18 13:29:37,203 INFO o.a.j.e.StandardJMeterEngine: All Setup Threads have ended
2025-05-18 13:29:37,226 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : jp@gc - Stepping Thread Group
2025-05-18 13:29:37,226 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group jp@gc - Stepping Thread Group.
2025-05-18 13:29:37,226 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-05-18 13:29:37,226 INFO k.a.j.t.AbstractSimpleThreadGroup: Starting thread group number 1 threads 1
2025-05-18 13:29:37,226 INFO k.a.j.t.AbstractSimpleThreadGroup: Started thread group number 1
2025-05-18 13:29:37,226 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-05-18 13:29:37,226 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Stepping Thread Group 1-1
2025-05-18 13:29:37,583 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = SachinJadhav-HP-Pavilion
2025-05-18 13:29:37,604 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-05-18 13:29:38,321 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2025-05-18 13:29:38,321 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2025-05-18 13:30:00,107 INFO o.a.j.r.Summariser: summary +    112 in 00:00:24 =    4.7/s Avg:     8 Min:     0 Max:   772 Err:    74 (66.07%) Active: 1 Started: 1 Finished: 0
2025-05-18 13:30:30,159 INFO o.a.j.r.Summariser: summary +     93 in 00:00:30 =    3.1/s Avg:   120 Min:     0 Max: 11082 Err:    62 (66.67%) Active: 1 Started: 1 Finished: 0
2025-05-18 13:30:30,159 INFO o.a.j.r.Summariser: summary =    205 in 00:00:54 =    3.8/s Avg:    59 Min:     0 Max: 11082 Err:   136 (66.34%)
2025-05-18 13:30:50,372 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: jp@gc - Stepping Thread Group 1-1
2025-05-18 13:30:50,372 INFO o.a.j.t.JMeterThread: Thread finished: jp@gc - Stepping Thread Group 1-1
2025-05-18 13:30:50,372 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-05-18 13:30:50,372 INFO o.a.j.r.Summariser: summary +     45 in 00:00:20 =    2.2/s Avg:   246 Min:     0 Max: 11061 Err:    30 (66.67%) Active: 0 Started: 1 Finished: 1
2025-05-18 13:30:50,372 INFO o.a.j.r.Summariser: summary =    250 in 00:01:14 =    3.4/s Avg:    92 Min:     0 Max: 11082 Err:   166 (66.40%)